<template>
 <nav-bar></nav-bar>
 <main>
    <article id='article' v-html="article"></article>
 </main>
 <site-footer></site-footer>
</template>

<script lang="ts">
    import { defineComponent, computed } from "vue";
    import { marked } from 'marked';
    import NavBar from '../components/NavBar.vue';
    import SiteFooter from "../components/SiteFooter.vue";
    export default defineComponent({
        name: 'Version',
        components: { NavBar, SiteFooter },
        setup() {
            const version = `
# 更新记录

## Release 1.3.7

### 更新日志

1. 修复了由于密码错误重新验证时，树洞登录数据也被清除的 Bug
2. UIS 注册时改为手动设置密码
3. 支持修改密码（只是加了个链接）
4. 修改了部分页面的设计
5. 修复了 Android 上公告过长时无法滚动的 Bug
6. 树洞登录界面支持按「提交」登录
7. 全新的树洞分区 Tab 设计
8. 全新的树洞搜索功能设计
9. 增加了「清净模式」屏蔽的 Emoji 种类
10. 部分页面增加说明文案
11. 彻底修复了各种页面出现「灰色长条」的问题
12. 修复了部分树洞图片只能查看无法保存的问题
13. 尝试减少了启动时的网络请求数量
14. 修复了旦夕无法登录、首页无法加载的问题（临时解决方案！）
15. 升级 Flutter 版本，可能缓解了后台黑屏问题。相应地，有一定性能损失
16. 为减小服务器压力，首页部分不常用功能变为点击查看

### 已知问题

1. 自由选择文本时，无法跨段选择
2. 部分华为设备上后台会黑屏
3. 当前页面只有一张图片时，不会显示左右滑动
4. 偶发不能滚动列表、不能回到顶部的问题


## Release 1.3.6-1

### 更新日志

新增游客模式，在无法登录 UIS 时可以在该模式下正常使用树洞等功能


## Release 1.3.6

### 更新日志

1. 新增课程表学期选择功能
2. 新增了课程表开学日期选择功能
3. 修复了课程表在浏览其他学期时出现异常周数（如「第 44 周」）的问题
4. 修复了显示全部楼层后，不能刷新帖子的问题
5. 新增平安复旦的打卡提醒
6. 新增入校权限的检查和提醒
7. 修改了平板上的底色为浅灰色（之前是蓝色）
8. 在「关于本应用」中增加了部分诊断功能
9. 不显示补缓考的成绩并提示用户自行查询，因为教务服务对此的处理有问题
10. 其他微小的 UI 改动

### 已知问题

1. 自由选择文本时，无法跨段选择
2. 部分华为设备上后台会黑屏
3. 当前页面只有一张图片时，不会显示左右滑动
4. 偶发不能滚动列表、不能回到顶部的问题


## Release 1.3.5

### 更新日志

1. 调整网络请求发送逻辑，避免并行发送数十个请求阻塞服务器
2. 完成了日语翻译（100%）
3. 修复了选择「去往底部」，再选择「只看洞主」后，回复列表自动刷新的问题
4. 部分支持了浏览量 API
5. 支持在图片页面左右滑动，浏览多张图片
6. 修复了在校外无法登录 UIS 的问题
7. 修复了树洞登录页面的错误文案
8. 修复了在 Material 上不能显示密码错误提示的问题
9. 支持在 Windows 端用方向键← → 浏览图片
10. 修复了 iOS 上滚动条异常的问题
11. 修复了定位进入一个图片较多的帖子时，应用卡死崩溃的问题
12. 尝试修复了截屏时弹出多个提示的问题
13. 修复了不在本学期时，课程表周数显示异常（-1 周、20 周）的问题

### 已知问题

1. 自由选择文本时，无法跨段选择
2. 部分华为设备上后台会黑屏
3. 首页的各项功能常常出现连接超时或加载错误
4. 定位时有一些鬼畜的滑动
5. 自己将帖子滚动到底部，选择「只看洞主」后，回复列表仍会从头自动刷新
6. 当前页面只有一张图片时，不会显示左右滑动


## Release 1.3.4

### 更新日志

1. 修复了平安复旦、教务处通知等无法自动登录的问题
2. 修复了 Android 端查看过长消息时卡片内容溢出的问题
3. 修复了同屏内有两张相同图片时，动画异常的问题
4. 增强了「校车班次」功能对异常数据的解析能力
5. 修复了应用在后台时，仍弹出截图警告的问题
6. 增加了 Android 上的开屏 Splash
7. 优化了滚动到帖子底部的使用体验
8. 修复了修改/删除帖子后发生位置跳转的问题
9. 增加只看洞主功能
10. 修复了 Android 端图片查看界面进度条颜色异常的问题
11. 修复了全屏编辑器直接灰屏的问题
12. 修改并更新了部分文案
13. 修复了 LaTeX 控件显示异常的问题，现在可以左右滑动查看了
14. 优化了首页的加载速度，修复了「校车班次」和「平安复旦」总是同时加载失败的问题
15. 修复了 GPA 加载失败时，点击 GPA 灰屏的问题
16. 修复了从长按上下文菜单选择「修改」，提交后无反应的问题
17. 修复了回复和修改帖子功能共用一份草稿，导致修改帖子时不显示原先内容的问题
18. 新增日语翻译（进度：10%）

### 已知问题

1. 自由选择文本时，无法跨段选择
2. 部分华为设备上后台会黑屏
3. 首页的各项功能常常出现连接超时或加载错误


## Release 1.3.3

### 更新日志

1. 修复 iOS 无法点击搜索框的问题
2. 支持在搜索框中直接搜索楼层号，如「##123456」
3. 修复了内容过长导致的卡片文本溢出的问题
4. 修复 iOS 上考试数据不能查看、无法切换学期的问题
5. 修复了 Material 中打开帖子时动画丢帧的问题
6. 添加了修改密码的链接
7. 支持从消息通知打开帖子时，跳转到对应楼层
8. 修复了无法滚动到分区底部的问题
9. 新增了搜索页面和搜索历史
10. 修复了刷新页面/切换分区时，列表不会回到顶部的问题
11. 修复了一些图片点击后灰屏的问题
12. 优化了「引用」在帖子外的显示逻辑
13. 修复了保存 Gif 动画时，只会保存一帧图片的问题
14. 支持从搜索结果打开帖子时，跳转到对应楼层
15. 修复了 iOS 无法打开部分页面的问题
16. 支持查看已读/全部消息通知
17. 优化了浏览树洞时的内存占用
18. 统一了部分界面 UI
19. 使用 @hasbai 提供的个人图床服务，暂时提供图床功能
20. 默认查看缩略图，支持点击后查看原图，并增加部分动画

###已知问题

1. 自由选择文本时，无法跨段选择
2. 部分华为设备上后台会黑屏
3. 后台截屏仍有截屏提示


## Release 1.3.2

### 更新日志

1. 修复了 Android 12 无法更新的 Bug
2. 其他微小的更新

### 已知问题

1. 自由选择文本时，无法跨段选择
2. iOS 上部分设备无法点击搜索框


## Release 1.3.1

### 更新日志

1. 支持研究生课表系统
2. 调整了课表的 UI 比例
3. 支持研究生身份登录，现在研究生/本科生有分开的登录方式了
4. 修复了同一时间有多门课程导致的重叠问题。你可以点击该门课程以显示所有重叠课程
5. 修复常常无法登录 UIS 的问题
6. 调整了 iOS 上的提示框 UI
7. 迁移树洞接口到新版树洞，此版本与老版树洞不兼容
8. 支持「提及」功能，引用其他帖子
9. 支持使用邮箱和密码登录
10. 修复了跳转帖子时的页面滚动异常
11. 支持新树洞「点赞」功能
12. 调整了所有错误提示页面，现在更加人性化了
13. 使用了新的树洞登录向导 UI
14. 跟进了树洞的加密认证方式
15. 支持新树洞「分区」和切换分区功能
16. 支持接受帖子收到回复时的通知推送，以及查看相关帖子
17. 支持新树洞「置顶」功能
18. 更新 Flutter 版本到 2.8.1
19. 初步支持 LaTex 的解析和渲染
20. 支持新树洞「修改发帖」、「删除发帖」功能
21. 支持搜索帖子时分页查看
22. 修复树洞页面偶发的闪烁问题
23. 支持选择接收通知的类型/关闭通知推送
24. 修复了 iOS 上「所有 Tag」页面不能滚动的问题
25. 调整了匿名昵称的显示方式
26. 支持全屏显示编辑器（编辑器页面右上角的「全屏」按钮）
27. 增加了树洞页面的截图警告
28. 同步跟进了 Watch OS 的新树洞支持
29. 修复了一些特殊代码的课程解析错误的问题
30. 在编辑器页面增加了一些公约提示
31. 初步弃用了 HTML 解析器
32. 支持了新树洞「忘记密码」和修改密码的功能
33. 理清了考试页面各种奇怪的显示逻辑，现在可以在各学期之间自由切换了
34. 支持显示图书馆人数（需要校内网络。部分图书馆可能名称对应错误）
35. 优化了点击教务处通知时的查看逻辑
36. 修复了非 iOS 平台上卡片显示异常的问题
37. 优化了被删除帖子的显示逻辑
38. 支持新树洞「浏览量统计」功能
39. 支持节日期间特殊欢迎语功能
40. 修复了部分考试成绩不显示的问题
41. 修复了 Windows 上托盘菜单不显示的问题
42. 优化了错误提示的友好性
43. 稍微加快复活码的显示速度和可靠性
44. 修复了时区不同带来的解析时间错误问题
45. 修复了无法显示开发组公告的问题
46. 树洞页面支持自定义背景图片
47. 修复了 iOS 上亮/暗色主题切换时，应用重启的问题
48. 彻底修复了平安复旦和教务处不会自动登录的问题
49. 修复了 iOS 上毛玻璃特效的显示问题
50. 尝试修复了部分帖子解析错误、导致显示成「超长灰色条」的问题
51. 支持点击「树洞」按钮以刷新树洞帖子列表
52. 支持基于楼层的折叠功能
53. 删除了一些对比度较低的 Tag 颜色
54. 更新大量中英翻译
55. 启用 SSL Pinning 机制，从而反抓包、反中间人攻击
56. 修改了判断复旦内网的逻辑
57. 标签增加缓存机制，减少加载时间
58. 与 Web 端树洞的 Tag 颜色保持一致
59. 修复了 MacOS 上部分页面显示异常的问题
60. 修复了平板视图下，无法弹出输入法打字的问题
61. 优化了网络请求数量到原来的 30%
62. 修改了部分颜色在暗色模式下的表现

### 已知问题

自由选择文本时，无法跨段选择


## Release 1.2.6-1

### 更新日志

1. 再次修复了刷锻无法获取的Bug
2. 补全了开发团队的信息
3. 在发帖时显示对话框，避免多次误触发送
4. 其他微小的 Bug 修复

### 已知问题

1. 自由选择文本时，无法跨段选择
2. Android 上总是无法显示广告（我们尚未申请通过 Android 端广告展示）


## Release 1.2.6

### 更新日志

1. 修复了收藏夹页面灰色的问题
2. 修复了树洞首页偶现灰色的问题
3. 优化了树洞的报错提示
4. 修复了食堂人数查询不能正常显示的问题
5. 修复了断网时首页无限转圈加载的问题
6. 修复了点击帖子无法跳转的问题
7. 修复了复活码无法加载的问题
8. 修复了重新加载时，总是无限转圈的问题
9. （除 iOS 版）增加了应用内检查更新的功能
10. 修复了发帖失败时草稿仍会清空的问题
11. 优化了课程表的显示方式
12. 更改了 Markdown 的解析方式。现在，无需打两次回车也能换行了
13. 升级到 Null-Safety 的 Dart 语法体系，为新版本框架兼容做准备
14. 修复了 iOS 端上下文菜单点击无反应的问题
15. 修复了刷锻查询失败的问题
16. 优化了刷新时的交互体验
17. 修复了一些拼写错误和不恰当的文案

### 已知问题

1. 自由选择文本时，无法跨段选择
2. Android 上总是无法显示广告（我们尚未申请通过 Android 端广告展示）


## Release 1.2.5

### 更新日志

1. 解决了 iOS 小屏设备上显示异常的 Bug
2. 修复了课程表星期显示错误的 Bug
3. 修复了课程表不会重新加载数据的 Bug
4. 解决了 iOS 上复活码不能关闭的 Bug
5. 改变了 Android 端包名，下载安装后请手动卸载旧版本的旦夕！

### 已知问题

1. 自由选择文本时，无法跨段选择
2. Android 上总是无法显示广告（我们尚未申请通过 Android 端广告展示）


## Release 1.2.4

### 更新日志

1. 解决了部分链接无法点击的问题
2. 修复了 GPA 排名里无法找到自己的问题
3. Windows 上支持设为开机启动
4. 修复了搜索结果页面不会显示「已经到底了」的问题
5. 修复了 Windows 上不能上传图片的问题
6. 修复了 SnackBar 颜色不对的问题
7. 开发组公告里的链接现在可以点击了
8. 修复了 Windows 上版本号一直显示为 1.0.0 的问题
9. 优化了树洞里图片的加载逻辑
10. 修复了点击跳转错位的问题
11. 移除了 Firebase 崩溃统计，我们不会再上传崩溃日志了
12. 增加了树洞图片缓存机制
13. 复了显示加载对话框时，文字下有两条黄线的问题
14. 修复了刷锻记录永远是「数据为空」的问题
15. 修复了 iOS 上的权限问题
16. 支持查询寝室用电数据
17. 支持自动保存帖子草稿，现在你可以放心地随时关闭编辑器了
18. 增加对颜色视觉障碍用户的辅助功能
19. 增加了广告 SDK 和赞助说明
20. 修复了切换账号时，树洞不会切换用户名的问题
21. 增加了标签黑名单功能
22. 切换树洞到新域名服务器，现在可以正常访问了

### 已知问题

1. 自由选择文本时，无法跨段选择
2. Android 上总是无法显示广告（我们尚未申请通过 Android 端广告展示）


## Release 1.2.3

### 更新日志

1. 修改了登录API，现在新生也可登录了
2. 修复了部分链接点击无反应的问题
3. 新增清净模式，希望能提高你的树洞浏览体验
4. 修复了首次登录时灰屏的问题
5. 修复了切换账号后，账号信息还是和原来一样的问题

### 已知问题

1. 自由选择文本时，无法跨段选择
2. 帖子内图片较多时，点击回复跳转可能会错位


## Release 1.2.2

### 更新日志

1. 修复了图片链接识别问题
2. 修复了 base64 图片显示问题
3. 修复了无法登录教务处的问题
4. 修复了加载下一页时的进度条显示问题
5. 支持显示空教室的座位数
6. 支持自由选择文本复制
7. 修复了点击 Tag 时白屏的问题
8. 支持校车查询
9. 加快了图片加载速度，增加了缓存机制
10. 修复了 Windows 上图片无法保存的问题
11. 修复了一些页面的滚动问题
12. 支持查看更早的公告
13. 重构了整个分页加载列表，现在更加稳定
14. 改变了点击回复行为，点击相应回复项会自动滑到该回复位置
15. 改变了回复行为，现在点击楼主的帖子与点击右上角回复按钮等价
16. 彻底修复了滑到底部后的鬼畜现象
17. Windows 上增加了托盘图标（但是还没有什么用）
18. 修复了 Android 上部分界面不能双击标题回顶部的问题
19. 彻底修复了 iOS 和 Windows 上部分页面滚动条无法拖动的问题
20. 修复了修改 UIS 密码后的旦夕的鬼畜现象
21. 支持查询图书馆人数（功能暂未开放）
22. 编辑器将以页面形式呈现，小屏设备编辑更方便

### 已知问题

1. 自由选择文本时，无法跨段选择
2. 帖子内图片较多时，点击回复跳转可能会错位
3. 某些链接点击后无反应
4. 新生（未开通校园一卡通）可能无法登录


## Release 1.2.1

### 更新日志

1. 在学期改变时自动重载课程表
2. 支持查看、保存、分享图片
3. 修复了关闭复活码后屏幕依然最亮的问题
4. 支持在无法链接内网时换用备用数据源
5. 支持平板和Windows端更友好的界面
6. 修复了弹出键盘时背景闪烁的问题
7. 支持在树洞界面点击最后一条回复时，直达底部
8. 支持 Tag 搜索和展示
9. 修复了按 Tag 筛选界面在刷新后报错的问题
10. 修复了 Windows 上文件保存无反应的问题
11. 帖子编辑器全面支持 Markdown 语法，并抛弃原来卡顿的 HTML 编辑器
12. 修复了大屏幕设备上关于界面显示异常的问题
13. 修复了链接解析错误的问题
14. 由设计师同学重新设计了新的图标
15. 修复了空教室无法查看的问题

###已知问题

1. 体育刷锻常常显示「空数据」
2. 在树洞界面点击最后一条回复时，进入页面可能出现鬼畜现象，需要快速上滑以解决。


## Release 1.1.2

### 更新日志

1. 修复了链接识别的问题
2. 修复了成绩无法查看的问题

### 已知问题

1. iOS 上，快速向下滑动帖子回复时，可能会自动弹回顶部
2. 考试相关信息常常获取失败，需要关闭应用（从最近应用列表划掉）重新打开
3. 某些页面可能无法直接拖动滑动条


## Release 1.1.1

### 更新日志

1. 空教室界面支持显示当前时间，方便对照查看
2. 修复了课程表加载的问题
3. 修复了考试日程无法查看的问题
4. 支持查看本学期各科目成绩
5. 改进了帖子里长图片的查看行为
6. 公告中的链接现在可以点击了
7. 支持从服务器获取本学期的开学日期
8. 在校外使用旦夕时，提示用户链接VPN
9. 修复了余额始终报错的问题
10. 支持显示 Markdown 格式的图片
11. 支持帖子内容预加载
12. 使用了实验性的帖子浏览新方式
13. 支持查看总计 GPA 和排名
14. 修复了 watchOS 上的树洞查看问题
15. 修复了帖子里链接无法正常点击，必须回复才能查看的问题
16. 获取各类信息的稳定性优化
17. UI 提升

已知问题
iOS 上，快速向下滑动帖子回复时，可能会自动弹回顶部
考试相关信息常常获取失败，需要关闭应用（从最近应用列表划掉）重新打开
某些页面可能无法直接拖动滑动条


## Release 1.1.0

### 更新日志

1. 支持储存上次浏览树洞时的帖子排序
2. 树洞 UI 微调
3. 支持在设置中改变对折叠内容的显示方式
4. 支持在设置中显示版本号（Windows 版暂不支持）
5. 修复了图片有时不显示的Bug
6. 支持查询期末考试日程
7. 给树洞换用了新的编辑器
8. 修复了界面中颜色的不一致
9. 修复了帖子页面Tag不能点击的Bug
10. 支持在树洞搜索中直接用"#+树洞号"直达某帖子
11. 初步支持了消息推送功能
12. 支持改变首页卡片顺序或新建卡片
13. 修复了自建浏览器不能下载的Bug
14. 支持了查询刷锻记录
15. 支持收藏树洞帖子
16. 支持自动识别树洞中的链接，并使其可点击
17. 修改了部分UI在iOS上的表现
18. 支持导出考试日程到ICS文件

### 已知问题

1. 有时首页信息会获取失败，刷新几次即可
2. iOS端有时查看教务处通知，却不会自动登录UIS


## Release 1.0.1

### 更新日志

1. 修复了 Android 上顶部的异常空格
2. 修复了 iOS 上树洞页面重复的 Bug
3. 修复了树洞中时间显示异常的 Bug

### 已知问题

有时首页信息会获取失败，刷新几次即可。


## Release 1.0.0

1. 换用了新的图标
2. 应用正式改名为旦夕！
3. 修复了树洞只能加载前十条回复的 Bug
4. 重制平安复旦功能
5. 修复了树洞标签显示问题
6. 支持按 Tag 过滤帖子
7. 修复了 iOS 上点击发帖弹出多个编辑器的问题
8. 支持浏览教务处公告时自动登录
9. 为准备发布 App Store，将版本号升级到1.0.0。 使用 iOS 的同学请关注开发组近期公告！


## Release 0.3.4 Pre-release

### 更新日志

1. 紧急修复了树洞无法登录的问题
2. 更新了树洞协议
3. 修复了编辑器无法选中文本的问题
4. 支持无标签的发帖
5. 支持树洞搜索帖子
6. 修复了 #35，#37
7. 修复了 iOS 平台无法切换浏览顺序的问题
8. 支持在首页显示下一课程
9. 支持查看往期公告

### 已知的问题

1. 课程表在无课的星期下显示异常
2. 顶部标题栏左侧存在不正常的空白
3. 非 iOS 平台上，树洞页面无法双击标题返回顶部


## Release 0.3.3 Pre-release

致 Android 用户： 本次更换了 Android 签名文件，如果您无法安装，请卸载旧版本后重新安装即可。

### 更新日志

1. 修复了 Windows 平台上公告不显示的 Bug
2. 修复了 iOS 平台上滚动条无法拖动的问题
3. iOS 平台上增加震动反馈
4. 支持发帖时上传图片
5. 支持切换发帖查看顺序
6. 支持 iOS 双击返回顶部
7. 其他微小的 Bug 修复

### 已知的存在问题

1. 树洞页面的搜索功能暂不可用，敬请期待。
2. 发帖编辑器在 iOS 平台上常常出现无法选中编辑文字的 Bug。
3. 切换发帖顺序有时无效


## 0.3.2 Pre-release

该更新紧急修复了由复旦服务器维护导致的bug，并有其他细节上的改进。

注意：树洞页面的搜索功能和排序功能暂不可用，敬请期待。


## 0.3.1 Pre-release

更新内容主要为树洞改进、bug修复和UI改进。


## Release 0.3.0 Pre-release

1. 修复无法登录的问题
2. 增加 Firebase 崩溃分析
3. 增加 macOS 上的图标
4. 修复了首页崩溃
5. 更新了关于界面
6. 初步接入 FDUHole 树洞服务（发帖功能未完成）
7. 修复了 iOS 的暗色模式显示问题
8. 空教室查询支持按照日期查询
9. 加快空教室查询加载速度
10. 支持论坛举报功能
11. 使平安复旦打卡兼容疫苗注射信息上报


## Release 0.2.1 Pre-release

1. 优化空教室查询 UI
2. 修复 iOS 标题栏闪烁问题
3. 支持举报回复
4. 支持显示开发组公告
5. 优化登陆错误提示
6. 桌面版大小调整
7. 其他微小的稳定性提升


## Release 0.2.0 Pre-release

1. 临时禁用了 iOS 上的夜间模式
2. 支持课程表显示和按周查询
3. 修复了 UIS 登陆问题
4. 修复了切换账号后课程表不更新的问题
5. 修复了出现验证码时不提示的问题
6. 修复了在网络较差时，反复要求用户注册论坛的问题
7. 支持切换主题（实验性）
8. 修复了 iOS 首次网络权限请求导致的登录问题
9. 在 iOS上改用平台图标
10. 使用了新的应用图标！
11. 增加了首页余额和食堂情况速览
12. 支持空教室查询
13. 修复了论坛加载空白问题
14. 修复了打开复活码崩溃的问题
15. 支持教务处通知查看
16. 增加了设置页面
17. 支持设置默认校区和切换账号
18. 增加了开源协议页面
19. 增加了隐私政策和使用条款
20. 支持 WatchOS 显示复活码
21. 支持启用后自动打卡平安复旦
22. 其他微小的 UI 和稳定性提升


## Release 0.1.0 Pre-release

Only android & windows available now.

`
            const article = computed(() => {
            return marked(version)
           })

           return {article}
        }
    })
</script>

<style lang="less">

</style>